<?php
$areas = [  "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург","Всеволжск","Павловск","Кронштадт"],
    "Рязанская область" => ["Рязань", "Касимов", "Скопин", "Михайлов", "Сасово"],
    "Брянская область" => ["Брянск", "Клинцы", "Новозыбков", "Карачев"]
];

$getFirstLetter = null;
foreach ($areas as $district => $cities){
    foreach ($cities as $city){
        $getFirstLetter = mb_substr($city, 0,1,"UTF-8");
        if($getFirstLetter == "К"){
            echo $city."<br>";
        }
    }
}